bernabeu-a/archc-msp430x/msp430x_syscall.H
/******************************************************
 * ArchC Architecture Dependent Syscall header file.  *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef msp430x_SYSCALL_H
#define msp430x_SYSCALL_H

#include "msp430x_arch.H"
#include "msp430x_arch_ref.H"
#include "msp430x_parms.H"
#include "ac_syscall.H"

//msp430x system calls
class msp430x_syscall : public ac_syscall<msp430x_parms::ac_word, msp430x_parms::ac_Hword>, public msp430x_arch_ref
{
public:
  msp430x_syscall(msp430x_arch& ref) : ac_syscall<msp430x_parms::ac_word, msp430x_parms::ac_Hword>(ref, msp430x_parms::AC_RAMSIZE), msp430x_arch_ref(ref) {};
  virtual ~msp430x_syscall() {};

  void get_buffer(int argn, unsigned char* buf, unsigned int size);
  void set_buffer(int argn, unsigned char* buf, unsigned int size);
  void set_buffer_noinvert(int argn, unsigned char* buf, unsigned int size);
  int  get_int(int argn);
  void set_int(int argn, int val);
  void return_from_syscall();
  void set_prog_args(int argc, char **argv);
};

#endif
